#include <bits/stdc++.h>
using namespace std;

int main()
{
  cout << (1 + 2) * 3 << endl; // 9

  // ≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡
  // ■ 細かい話
  // https://atcoder.jp/contests/apg4b/tasks/APG4b_d
  // ≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡

  // ===============================================
  // ■ 負の数の剰余
  // ===============================================
  //   剰余演算A % Bを行う時にAまたはBが負の数の場合、計算結果は以下のようになります。
  //   ・Aが正のとき：|A|%|B|
  //   ・Aが負のとき：-(|A|%|B|)
  // つまりBの正負に関わらず、計算結果はAの正負と一致します。
  // より正確に言うと、C++の剰余演算子は(A / B) * B + (A % B)とAが等しくなるように定義されており、結果的にAの正負と一致します。

  cout << "-------------------------------------" << endl;
  int a_1 = 10;
  int b_1 = 4;
  cout << a_1 % b_1 << endl;
  cout << "-------------------------------------" << endl;
  int a_2 = -10;
  int b_2 = 4;
  cout << a_2 % b_2 << endl;
  cout << "-------------------------------------" << endl;
  int a_3 = 10;
  int b_3 = -4;
  cout << a_3 % b_3 << endl;
  cout << "-------------------------------------" << endl;
  int a_4 = -10;
  int b_4 = -4;
  cout << a_4 % b_4 << endl;
  cout << "-------------------------------------" << endl;
}